In [107]:
import pandas as pd 
  
# Creates DataFrame. 
df = pd.DataFrame([
    {'nom': 'john', 'nb': 2, 'year':2000}, 
    {'nom': 'john', 'nb': 3, 'year':2001},
    {'nom': 'rony', 'nb': 1, 'year':2001},
    {'nom': 'samy', 'nb': 1, 'year':2002}]
) 

counts = df.nb.apply(lambda x: list(range(1, x + 1)))  # replace numbers by a list with x items

serie = pd.DataFrame(
    counts.tolist()  # build dataframe from a list of list
).stack(  # reorganize table to get columns names as row names (sort of)
).reset_index(
    level=1, drop=True  # remove the column 1 (the former column names)
).rename('count')  # add name so that the serie can be joined with a dataframe
     

df = df.join(serie).drop(['nb', 'count'], axis=1)

df

    nom  year
0  john  2000
0  john  2000
1  john  2001
1  john  2001
1  john  2001
2  rony  2001
3  samy  2002